# _____
# Fonts
tap 'homebrew/cask-fonts'

cask 'font-cascadia-pl'
cask 'font-cascadia'
cask 'font-fira-code'
cask 'font-iosevka'
cask 'font-jetbrains-mono'


# ___
# Dev
brew 'bat'
brew 'cmake'
brew 'fish'
brew 'git'
brew 'gnupg'
brew 'neovim'
brew 'starship'
brew 'tmux'

# C++
brew 'llvm'

# Swift
brew 'swift-format'
brew 'swiftformat'

# Casks
cask 'alacritty'
cask 'gitkraken'
cask 'jetbrains-toolbox'
cask 'postman'
cask 'visual-studio-code'


# __________
# Other apps
cask 'notion'
cask 'protonvpn'
cask 'spotify'
