# _____
# Fonts
tap 'homebrew/cask-fonts'

cask 'font-cascadia-code-pl'
cask 'font-cascadia-code'
cask 'font-fira-code'
cask 'font-iosevka'
cask 'font-jetbrains-mono'


# ___
# Dev
brew 'bat'
brew 'cmake'
brew 'fish'
brew 'git'
brew 'gnupg'
brew 'neovim'
brew 'perl'
brew 'starship'
brew 'tmux'
brew 'tokei'

# C++
brew 'llvm'
brew 'sfml'

# JavaScript
brew 'node'

# Python
brew 'python'

# Swift
brew 'swift-format'
brew 'swiftformat'

# Casks
cask 'alacritty'
cask 'gitkraken'
cask 'jetbrains-toolbox'
cask 'mactex-no-gui'
cask 'postman'
cask 'visual-studio-code'


# __________
# Other apps
cask 'adobe-acrobat-reader'
cask 'blackhole-2ch'
cask 'google-chrome'
cask 'imageoptim'
cask 'notion'
cask 'obs'
cask 'protonvpn'
cask 'spotify'
cask 'zoom'
